src/cf/Catalogs/уатШаблоныЗаполненияПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатШаблоныЗаполненияПоУслугам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимЗаполнения</Name>
					<Comment>0 - предоставленными, 1 - невыставленными</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьПоПолямДетализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеТТД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеЗаказНаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеЗаказПеревозчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеМаршрутныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеКорректировкаЗаписей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеРекламаций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеЗаказТакси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеАрендаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеСтраховойСертификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СортировкаЗаказов</Name>
					<Comment>0 - дата заказа , 1 - время отправления, 2 - время прибытия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетализацияЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолеРегистра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатШаблоныЗаполненияПоУслугам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	Макет = Справочники.уатШаблоныЗаполненияПоУслугам.ПолучитьМакет("НастройкиПредопределенныхЭлементов");
	ОбластьНастроек = Макет.ПолучитьОбласть("Строки|Колонки");
	
	Для НомерСтроки = 1 По ОбластьНастроек.ВысотаТаблицы Цикл
		ИмяПредопрЭлемента = ОбластьНастроек.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		
		Попытка
			ТекЭлемент = Справочники.уатШаблоныЗаполненияПоУслугам[ИмяПредопрЭлемента];
		Исключение
			Продолжить;
		КонецПопытки;
		
		СпрОбъект = ТекЭлемент.ПолучитьОбъект();
		
		СпрОбъект.ПолучательУслуг                        = Перечисления.уатПолучателиУслуг[ОбластьНастроек.Область(НомерСтроки, 2, НомерСтроки, 2).Текст];
		СпрОбъект.РежимЗаполнения                        = Число(ОбластьНастроек.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		СпрОбъект.СворачиватьПоПолямДетализации          = Число(ОбластьНастроек.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		СпрОбъект.ИспользоватьДанныеТТД                  = Число(ОбластьНастроек.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
		СпрОбъект.ИспользоватьДанныеЗаказНаТС            = Число(ОбластьНастроек.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			СпрОбъект.ИспользоватьДанныеЗаказПеревозчику = Число(ОбластьНастроек.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);
			СпрОбъект.ИспользоватьДанныеМаршрутныйЛист   = Число(ОбластьНастроек.Область(НомерСтроки, 10, НомерСтроки, 10).Текст);
		КонецЕсли;
		Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
			СпрОбъект.ИспользоватьДанныеЗаказТакси = Число(ОбластьНастроек.Область(НомерСтроки, 8, НомерСтроки, 8).Текст);
			СпрОбъект.ИспользоватьДанныеАрендаТС   = Число(ОбластьНастроек.Область(НомерСтроки, 9, НомерСтроки, 9).Текст);
		КонецЕсли;
		СпрОбъект.ИспользоватьДанныеКорректировкаЗаписей = Число(ОбластьНастроек.Область(НомерСтроки, 11, НомерСтроки, 11).Текст);
		СпрОбъект.СортировкаЗаказов                      = Число(ОбластьНастроек.Область(НомерСтроки, 12, НомерСтроки, 12).Текст);
		СпрОбъект.ИспользоватьДанныеРекламаций           = Число(ОбластьНастроек.Область(НомерСтроки, 13, НомерСтроки, 13).Текст);
		СпрОбъект.ИспользоватьДанныеСтраховойСертификат  = Число(ОбластьНастроек.Область(НомерСтроки, 14, НомерСтроки, 14).Текст);
		
		СпрОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Функция возвращает строковое представление через запятую состава документов,
// данные которых используются в шаблоне заполнения услуг
//
// Параметры:
//  ШаблонЗаполнения - СправочникОбъект.уатШаблоныЗаполненияПоУслугам - шаблон заполнения
// 
// Возвращаемое значение:
//  Строка - состав видов документов
//
Функция ПредставлениеВидыДокументов(ШаблонЗаполнения) Экспорт
	
	НадписьВидыДокументов =
		?(ШаблонЗаполнения.ИспользоватьДанныеТТД, "ТТД, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеЗаказНаТС, "Заказ на ТС, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеЗаказПеревозчику, "Заказ перевозчику, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеМаршрутныйЛист, "Маршрутный лист, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеРекламаций, "Рекламация, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеСтраховойСертификат, "Страховой сертификат, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеЗаказТакси, "Заказ такси, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеАрендаТС, "Аренда ТС, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеКорректировкаЗаписей, "Корректировка записей регистров, ", "");
	Возврат НадписьВидыДокументов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
